ЧартерEDT.Расширение1/src/Catalogs/чартер_ПосадочныеМестаНаРейс/чартер_ПосадочныеМестаНаРейс.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>чартер_ПосадочныеМестаНаРейс</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Класс</name>
    <type>
      <types>EnumRef.чартер_КлассыМестВС</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнфоСообщение</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнфоАктивно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КомпоновкаВС</name>
    <type>
      <types>EnumRef.чартер_ТипВСРассадка</types>
    </type>
  </attributes>
</mdclass:Catalog>

ЧартерEDT.Расширение1/src/Catalogs/чартер_ПосадочныеМестаНаРейс/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Получить посадочное место.
// 
// Параметры:
//  ВыборанноеМесто - Строка 
//  КомпоновкаРейса - ПеречислениеСсылка - чартер_ТипВСРассадка
// 
// Возвращаемое значение:
//  Неопределено, Структура - Получить посадочное место:
//  *НомерМеста - СправочникСсылка 
//  *ИнфоАктивно - Булево
//  *ИнфоСообщение - Строка
//
Функция ПолучитьПосадочноеМесто(ВыборанноеМесто, КомпоновкаРейса) Экспорт
	
	ВыбранноеМесто = Новый Структура;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	чартер_ПосадочныеМестаНаРейс.Ссылка КАК Ссылка,
		|	чартер_ПосадочныеМестаНаРейс.ИнфоСообщение КАК ИнфоСообщение,
		|	чартер_ПосадочныеМестаНаРейс.ИнфоАктивно КАК ИнфоАктивно
		|ИЗ
		|	Справочник.чартер_ПосадочныеМестаНаРейс КАК чартер_ПосадочныеМестаНаРейс
		|ГДЕ
		|	чартер_ПосадочныеМестаНаРейс.Наименование = &Наименование
		|	И чартер_ПосадочныеМестаНаРейс.КомпоновкаВС = &КомпоновкаВС";
	
	Запрос.УстановитьПараметр("Наименование", ВыборанноеМесто);
	Запрос.УстановитьПараметр("КомпоновкаВС", КомпоновкаРейса);
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Неопределено;
	Иначе  
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			ВыбранноеМесто.Вставить("НомерМеста", Выборка.Ссылка);
			ВыбранноеМесто.Вставить("ИнфоАктивно", Выборка.ИнфоАктивно);
			ВыбранноеМесто.Вставить("ИнфоСообщение", Выборка.ИнфоСообщение);
		КонецЦикла;
        //@skip-check constructor-function-return-section
        Возврат ВыбранноеМесто;
	КонецЕсли;
	
КонецФункции

// Поолучить класс места ВС.
// 
// Параметры:
//  Место - СправочникСсылка
//  КомпоновкаРейса - ПеречислениеСсылка - Компоновка рейса
// 
// Возвращаемое значение:
//	 СправочникСсылка - чартер_ПосадочныеМестаНаРейс 
//
Функция ПоолучитьКлассМестаВС(Место, КомпоновкаРейса) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	чартер_ПосадочныеМестаНаРейс.Класс КАК Класс
	               |ИЗ
	               |	Справочник.чартер_ПосадочныеМестаНаРейс КАК чартер_ПосадочныеМестаНаРейс
	               |ГДЕ
	               |	чартер_ПосадочныеМестаНаРейс.Ссылка = &Место
	               |	И чартер_ПосадочныеМестаНаРейс.КомпоновкаВС = &КомпоновкаВС";
	
	Запрос.УстановитьПараметр("Место", Место);
	Запрос.УстановитьПараметр("КомпоновкаВС", КомпоновкаРейса);
	
	Результат = Запрос.Выполнить();	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	
	Возврат  Выборка.Класс;

КонецФункции

#КонецОбласти   

#КонецЕсли
